# coding: utf-8
class Location < ActiveRecord::Base
  attr_accessible :name
  
  has_many :laws
  
  def self.all_locations
    [
      ["北京", 1],
      ["天津", 2],
      ["上海", 3],
      ["重庆", 4],
      ["河北", 5],
      ["山西", 6],
      ["内蒙古", 7],
      ["辽宁", 8],
      ["吉林", 9],
      ["黑龙江", 10],
      ["江苏", 11],
      ["浙江", 12],
      ["安徽", 13],
      ["福建", 14],
      ["江西", 15],
      ["山东", 16],
      ["河南", 17],
      ["湖北", 18],
      ["湖南", 19],
      ["广东", 20],
      ["广西", 21],
      ["海南", 22],
      ["四川", 23],
      ["贵州", 24],
      ["云南", 25],
      ["陕西", 26],
      ["甘肃", 27],
      ["宁夏", 28],
      ["青海", 29],
      ["新疆", 30],
      ["西藏", 31],
      ["香港", 32],
      ["澳门", 33],
      ["台湾", 34]
    ]
  end
end
